[
    {
        "articlenum": "1",
        "header": "An open letter to recent college graduates",
        "preview": [
            {
                "img": "https://miro.medium.com/max/4150/1*GGft_aeszJhTQV1sPMzDWQ.jpeg",
                "caption": "https://www.unpakt.com/blog/7-best-cities-for-young-college-grads/"
            }
        ],
        "article_content": [
            {
                "p": "You spent a long four or five years in which you have shared great moments with other people. You have been through unforgettable experiences. You made friends that you will probably keep for the rest of your life. A whole host of moments that, without a doubt, have marked in your life."
            },
            {
                "article_header": "Hey, congratulations!"
            },
            {
                "p": "You also had to go through some bittersweet circumstances during these years, such as those terrible exams and quizzes that you had to memorize; those boring internship tasks that you had to spend so many hours on and which unfortunately had little impact on your professional training; professors whose courses you had to catch up with and who made you think about the quality of schooling that cost you so much, and so on."
            },
            {
                "p": "Not everything has been rosy."
            },
            {
                "p": "But that’s all of your past already."
            },
            {
                "p": "Now it’s time to start again."
            },
            {
                "p": "Go back to that scenario when you turned 17 and made that decision to study this profession."
            },
            {
                "p": "But now it’s not like before. These years have brought you to maturity and growth. You now have a different view of money and are very likely realized the difficulty of getting it today."
            },
            {
                "p": "You may be staying at the house of your parents or have to come back, now that you have graduated from college, but then again, you are not the same person anymore. You are now independent."
            },
            {
                "p": "You may not yet have a job or you don’t really know yet what to do in your life. You’re not alone in facing this experience, neither the confusion nor the feeling of depression nor even the delay in getting that dream profession."
            },
            {
                "p": "You’ve now got something worth more than anything else. It’s F-R-E-E-D-O-M. The power to choose your path."
            },
            {
                "p": "You’re now free."
            },
            {
                "p": "This is your moment."
            },
            {
                "p": "Do not be intimidated by social pressure or by your fears."
            },
            {
                "p": "Create your own choices."
            },
            {
                "p": "You did it four years ago when you chose to begin this journey that consumed you so much investment: sweat, money, and time. You completed high school and you were told by society that the immediate thing was to enroll in an in-demand profession in college, despite not being evident about your place in this life."
            },
            {
                "p": "You might have decided right and you are now where you wanted to be, or maybe you might not be completely pleased with the results."
            },
            {
                "p": "But that no longer matters."
            },
            {
                "p": "Now you have to think about everything."
            },
            {
                "p": "What’s the next step for you? The high unemployment rate and the pessimism that our society consumes are making things more torn apart."
            },
            {
                "p": "Unless that Master’s Degree is the only way to accomplish your dream, do not enroll. Not today at least. Pause to reflect for a while before proceeding with the next phase of your career."
            },
            {
                "p": "Your time is the most important thing, so try not to sell it to the first bidder."
            },
            {
                "p": "You are now a man that is more mature and independent. It’s time to put the cards on the table, shuffle the various options and bet on the best one. Consider what your next step is going to be and make sure it is going to take you where you dream."
            },
            {
                "p": "This is your moment, so do not waste it."
            },
            {
                "p": "Take advantage of the end of this stage to relax, reflect and, above all, enjoy the most of each moment."
            },
            {
                "p": "Just do not stop dreaming, and continue to make yourself eager to succeed, go for your dream and cheer for you in terms of success, and do not make anything stop you and hinder your insistence. Do not get carried away by the fear and insecurities of society and become the sole owner of your decisions."
            },
            {
                "p": "After university life, it is time to put your fingerprints and make an impact in this life. Many lived for decades without being heard by their names, and some did not exceed 20 and have a resounding name in this world."
            },
            {
                "p": "The greatest achievements began with an idea and with determination, and challenge turned into great achievements and changed the world. Look at the lives of the successful people and the simplicity of the ideas they started. You will know that you can achieve success. You will reach what you want and always remember that the most important reason for success is to convince you of your abilities and your determination to succeed. Listen to yourself well and all the time that you are capable of success."
            },
            {
                "p": "Without further ado, I want to congratulate you again for that long-awaited graduation. You finally made it!"
            },
            {
                "code": "var numbers_m2 = []; \nfor (i = 0; i < numbers.length; i++) { \nnumbers_m2.push(numbers[i] * 2); \n} \nconsole.log(numbers_m2);"
            },
            {
                "article_items": [
                    {
                      "item_img": "https://miro.medium.com/max/320/0*JsCxh8ckwJllI2In",
                      "item_header": "uiGradients - Beautiful colored gradients",
                      "item_desc": "uiGradients is a handpicked collection of beautiful color gradients for designers and developers.",
                      "item_extra": "uigradients.com"
                    },
                    {
                        "item_img": "https://miro.medium.com/max/320/0*I3TiS0a273hCok0-",
                        "item_header": "vercel/next.js",
                        "item_desc": "The React Framework. Contribute to vercel/next.js development by creating an account on GitHub.",
                        "item_extra": "github.com"
                    },
                    {
                        "item_img": "https://miro.medium.com/max/320/0*O_WVawBCrBy-WXTh",
                        "item_header": "negomi/react-burger-menu",
                        "item_desc": "hamburger: An off-canvas sidebar component with a collection of effects and styles using CSS transitions and SVG path...",
                        "item_extra": "github.com"
                    },
                    {
                        "item_img": "https://miro.medium.com/max/320/0*fyrM-xp9LumtS-Ow",
                        "item_header": "Introduction - Semantic UI React",
                        "item_desc": "Button Container Divider Flag Header Icon Image Input Label List Loader Placehoder Rail Reveal Segment Step",
                        "item_extra": "react-semantic-ui.com"
                    }

                  ]
            },
            {
                "article_list": [
                    {
                        "list_item": "Map evokes a function on every item in an array and it can return anything. It can have something to do in the current item’s value either do a mathematical equation or concatenation."
                    },
                    {
                        "list_item": "Filter has a condition and only the items on which the condition returns true will be pushed to a new set of array."
                    },
                    {
                        "list_item": "Reduce has an accumulator and a current value and you can do something with these two parameters like add them together to combine all the values in the array which then results to a one big single value."
                    },
                    {
                        "list_item": "Find and findIndex is both used to find the first element that matches a condition."
                    }
                  ]
            },
            {
                "inl_img": [
                    {
                      "img": "https://miro.medium.com/max/800/1*Xiwgf8LfUcUlNVKXT7pykg.gif",
                      "caption": "Back then, I was so inspired in the look of Microsoft’s Metro UI so I created the layout of my page together with Metro Flat UI CSS and some CSS3 animations."
                    }
                  ]
            }
            
        ],
        "categories": [
            "College",
            "Motivation",
            "Graduation",
            "University",
            "Goals"
        ]
    }
]